import { buildImageGame } from './imageGame'

export default {
  image_game: buildImageGame('hi'),

  "name_1": "टमाटर",
  "name_2": "कसाबा",
  "name_3": "अंगूर",
  "name_4": "कीनू",
  "name_5": "आम",
  "name_6": "सेब",
  "name_7": "चकोतरा",
  "name_8": "कोको",
  "name_9": "Cocojujube",
  "name_10": "रेडवुड",
  "name_11": "उर्वरक",
  "name_12": "पानी",
  "name_13": "दस्ताने",
  "name_14": "कीटनाशक",
  "name_15": "फावड़ा",
  "name_16": "ब्लाइंड बॉक्स",
  "name_17": "कर्म",
  "determine": "निर्धारित करें",
  "confirm": "पुष्टि करें",
  "sign_out": "साइन आउट करें",
  "my_game_log": "मेरा गेम लॉग",
  "fertility": "प्रजनन क्षमता",
  "fertilizer": "उर्वरक",
  "fertilizer2": "उर्वरक",
  "land": "भूमि",
  "deed": "कर्म",
  "level": "स्तर",
  "land_formation": "भूमि निर्माण",
  "production_increases": "उत्पादन बढ़ता है",
  "plant_cost": "पौधे की लागत",
  "rule": "नियम",
  "confirm_the_synthesis": "संश्लेषण की पुष्टि करें",
  "synthetic_rules": "सिंथेटिक नियम",
  "my_git": "मेरा USDT",
  "my_ispay": "मेरा ISPAY",
  "today_income": "आज",
  "balance": "संतुलन",
  "deduct": "कटौती",
  "price": "कीमत",
  "day": "दिन",
  "date": "दिनांक",
  "submit_date": "जमा करने की तिथि",
  "incoming": "आवक",
  "stake": "दांव",
  "period": "अवधि",
  "can_withdraw": "यू लिमिट निकाल सकते हैं",
  "reward": "इनाम",
  "please_enter_the_amount": "कृपया राशि दर्ज करें",
  "please_enter_the_correct_amount": "कृपया सही मात्रा दर्ज करें",
  "please_enter_the_address": "कृपया पता दर्ज करें",
  "confirm_wait": "प्रतीक्षा की पुष्टि करें",
  "redemption": "मोचन",
  "prev": "पिछला",
  "last": "अंतिम",
  "first": "पहला",
  "next": "अगला",
  "skip": "पर जाएं",
  "success": "सफलता",
  "recharge_success": "रिचार्ज सफलता",
  "blind_box": "ब्लाइंड बॉक्स",
  "magic_blind_box": "मैजिक ब्लाइंड बॉक्स",
  "countdown_timer": "उलटी गिनती घड़ी",
  "total_order": "प्रतीक्षारत आदेश",
  "left_amount": "शेष राशि",
  "total": "कुल",
  "number_sold": "नंबर बिक गया",
  "my_balance": "मेरा संतुलन",
  "my_pledge": "मेरी प्रतिज्ञा",
  "to_buy_now": "अभी खरीदने के लिए",
  "open_box_get_products": "बॉक्स खोलें और उत्पाद प्राप्त करें",
  "seed": "बीज",
  "seeds": "बीज",
  "prop": "प्रोप",
  "language": "भाषा",
  "music": "संगीत",
  "congratulations": "बधाई हो",
  "synthesis_uccess": "संश्लेषण सफलता",
  "goods_not_enough": "सामान पर्याप्त नहीं है",
  "please_select_land": "कृपया भूमि का चयन करें",
  "please_select_goods": "कृपया सामान चुनें",
  "please_select_different_land": "कृपया विभिन्न भूमियों का चयन करें",
  "buying_success": "सफलता खरीदना",
  "buy_again": "दोबारा खरीदें",
  "game_balance": "खेल संतुलन",
  "wallet_balance": "बटुए का संतुलन",
  "fee": "शुल्क",
  "pledge_pool": "प्रतिज्ञा पूल",
  "pledge": "प्रतिज्ञा",
  "pledge_record": "प्रतिज्ञा रिकॉर्ड",
  "wait_record": "प्रतीक्षा रिकार्ड",
  "start_game": "गेम प्रारंभ करें",
  "get": "प्राप्त करें",
  "lose": "हारना",
  "play_again": "फिर से खेलें",
  "you_win": "आप जीतें",
  "you_lose": "तुम हार गए",
  "sorry": "क्षमा करें",
  "yield": "उपज",
  "grown": "बड़ा हो गया",
  "off_the_shelves": "अलमारियों से बाहर",
  "end_of_lease": "पट्टे की समाप्ति",
  "sell": "बेचो",
  "default": "डिफ़ॉल्ट",
  "bulk_sell": "थोक बिक्री",
  "bulk_rent": "थोक किराया",
  "open": "खुला",
  "market": "बाज़ार",
  "leasing": "पट्टे पर देना",
  "mine": "मेरा",
  "hide": "छिपाओ",
  "show": "दिखाओ",
  "send": "भेजें",
  "search": "खोजें",
  "buy": "खरीदें",
  "cancel": "रद्द करें",
  "copy_success": "सफलता की प्रतिलिपि बनाएँ",
  "owner": "मालिक",
  "confirm_purchase": "खरीद की पुष्टि करें",
  "buy_now": "अभी खरीदें",
  "to_buy": "खरीदने के लिए",
  "to_his_house": "उसके घर तक",
  "holders": "धारक",
  "description": "विवरण",
  "blockchain_network": "ब्लॉकचेन नेटवर्क",
  "world": "विश्व",
  "my_friend": "मेरे दोस्त",
  "not_yet_open": "अभी खुला नहीं है",
  "notice": "सूचना",
    "menu_label_notice": "सूचना",
  "menu_label_seed": "बीज एम्प",
  "menu_label_granary": "अन्न भंडार",
  "menu_label_blind": "ब्लाइंड बॉक्स",
  "menu_label_auction": "नीलामी",
  "menu_label_land": "भूमि",
  "menu_label_store": "गोदाम",
  "menu_label_market": "NFT बाज़ार",
  "pop_title_user_info": "प्रोफ़ाइल",
  "pop_title_income": "मेरी आय",
  "pop_title_result": "परिणाम",
  "pop_title_rank": "रैंकिंग",
  "pop_title_balance": "बैलेंस",
  "pop_title_login": "वॉलेट लॉगिन",
  "pop_title_login_success": "वॉलेट जुड़ा!",
  "pop_title_sale": "बिक्री सेटिंग",
  "pop_title_rent": "किराया सेटिंग",
  "rank": "पद",
  "user_name": "उपयोगकर्ता नाम",
  "manor": "जागीर",
  "neighbor": "पड़ोसी",
  "recharge": "रिचार्ज",
  "setting": "सेटिंग",
  "harvest": "फ़सल",
  "withdraw": "वापस लेना",
  "withdraw2": "वापस लेना",
  "game_id": "गेम आईडी",
  "transfer": "स्थानांतरण",
  "exchange": "विनिमय",
  "performance": "प्रदर्शन",
  "invite_git": "आमंत्रित करेंISPAY",
  "inviter": "निमंत्रक",
  "neighbors": "पड़ोसी",
  "more": "अधिक",
  "address": "पता",
  "time": "समय",
  "bonus_time": "बोनस समय",
  "game": "खेल",
  "wallet": "बटुआ",
  "warehouse": "गोदाम",
  "plant": "पौधा",
  "select": "चयन करें",
  "rent": "किराया",
  "cultivate": "खेती करो",
  "cultivate_land": "भूमि पर खेती करें",
  "change_land": "भूमि बदलें",
  "revoke_land": "भूमि निरस्त करें",
  "sell_success": "सफलता बेचें",
  "rent_success": "किराया सफलता",
  "buy_success": "सफलता खरीदें",
  "to_his_hourse": "उसके घंटे के लिए",
  "harvest_ratio": "फसल अनुपात",
  "off_the_shelves_success": "शेल्फ़ से बाहर सफलता",
  "address_empty": "पता खाली नहीं है",
  "level2": "स्तर",
  "subscription_amount": "सदस्यता राशि",
  "ratio": "अनुपात",
  "released": "जारी किया गया",
  "not_released": "जारी नहीं किया गया",
  "static_state": "स्थैतिक अवस्था",
  "direct_push": "सीधा धक्का",
  "direct_acceleration": "प्रत्यक्ष त्वरण",
  "team": "टीम",
  "good_ordinary": "अच्छा साधारण",
  "all_dividend": "सभी लाभांश",
  "total_performance": "कुल प्रदर्शन",
  "direct_performance": "प्रत्यक्ष प्रदर्शन",
  "regional_performance": "क्षेत्रीय प्रदर्शन",
  "community_performance": "सामुदायिक प्रदर्शन",
  "direct_number": "सीधा नंबर",
  "activated_number": "सक्रिय संख्या",
  "team_number": "टीम संख्या",
  "to_buy_detail": "विवरण खरीदें",
  "amt": "रकम",
  "daily": "दैनिक",
  "subscribe": "सदस्यता लें",
  "direct": "प्रत्यक्ष",
  "static": "स्थैतिक",
  "all_net": "सभी नेट",
  "level_number": "स्तर संख्या",
  "all": "सब",
  "my_plant": "मेरा पौधा",
  "company": "कंपनी",
  "community": "समुदाय",
  "mining": "खनन",
  "please_set_your_neighbor": "कृपया अपने पड़ोसी को सेट करें",
  "please_ennter_the_neighbor_id": "कृपया पड़ोसी आईडी दर्ज करें",
  "please_visit_the_game_in_the_following_wallet": "कृपया निम्नलिखित वॉलेट में गेम पर जाएँ!",
  "granary_rule": "उपयोगकर्ता 0.3% के दैनिक रिटर्न के साथ ISPAY को भंडार में संग्रहीत कर सकते हैं, जिसे किसी भी समय भुनाया जा सकता है; भंडारण के बाद अगले दिन 0:00 UTC+8 समय के बाद ब्याज अर्जित होगा (डी+1);",
  "land_rule": "आप नई भूमि बनाने के लिए भूमि + भूमि, उर्वरक + फल का उपयोग कर सकते हैं। भूमि को अलग-अलग दुर्लभता और उर्वरता के साथ स्मार्ट कॉन्ट्रैक्ट स्टोकेस्टिक एल्गोरिदम के अनुसार यादृच्छिक रूप से आवंटित किया जाता है। जितनी कम दुर्लभता, उतना अधिक उपज बोनस, उतनी अधिक उर्वरता, उतने ही अधिक पौधे लगाए जा सकते हैं!",
  "all_rule": `मैजिक क्रिस्टल फार्म: गेमप्ले गाइड

I. ब्लाइंड बॉक्स: एक ब्लाइंड बॉक्स को खोलने में 100 यू का खर्च आता है और इसमें बीज या वस्तुएं प्राप्त करने का मौका होता है। बीजों की अधिकतम संख्या 117 और न्यूनतम 106 है।

द्वितीय. सीड एम्पलीफायर: PoS तंत्र का उपयोग करके एक मजेदार गेमप्ले मोड, जहां खिलाड़ी डीलर के रूप में कार्य कर सकते हैं।

तृतीय. मेननेट स्टेकिंग

चतुर्थ. दैनिक भूमि खरीद राजस्व (5000 आईपे भारित वितरण)

वी. प्रत्यक्ष भूमि रेफरल:
पहली पीढ़ी: 3%
दूसरी पीढ़ी: 2%
तीसरी पीढ़ी: 1%
प्रबंधन बोनस: (स्तरीय अंतर)

VI. बीज सूची (प्रतिदिन दो बार पौधारोपण करें)

1: टमाटर: 106-108U

2: खरबूजा: 107-109यू

3: अंगूर: 108-109U

4: नारंगी: 109-111यू

5: आम: 100-112U

6: सेब: 111-113यू

7: चकोतरा: 112-114यू

8: नारियल: 112-115यू

9: दिनांकः 113-116उ

10: रेडवुड: 114-117यू डायरेक्ट रेफरल रेवेन्यू स्टेकिंग रेवेन्यू

पहली पीढ़ी: 0.3%

दूसरी पीढ़ी: 0.2%

तीसरी पीढ़ी: 0.1%

VII: वस्तु उपयोग

1: फावड़ा: पौधे को एक घंटे के भीतर हटने से रोकने के लिए उपयोग किया जाता है। पौधे को हटाने पर किरायेदार को वर्तमान उपज का 106 * 0.5% = 0.53 प्राप्त होता है।

2: पानी देना: विकास के दौरान पौधों में 5% "पानी की आवश्यकता" तंत्र होता है; पानी के बिना विकास रुक जाता है। यह वस्तु विकास को रुकने से रोकती है।

3: कीटनाशक: वृद्धि के दौरान कीड़े लगने की 5% संभावना होती है। यदि उपयोग नहीं किया गया तो विकास रुक जायेगा।

4: दस्ताने: "फसलें चुराने" के लिए 50 बार तक इस्तेमाल किया जा सकता है। प्रत्येक रोपण का 1%. दूरी 106 * 1% = 1.06

5: भूमि किराया: अन्य उपयोगकर्ताओं को भूमि किराए पर देने पर किराएदार को मिलने वाले फलों के पेड़ों की संख्या का 4% प्राप्त होगा।  उदाहरण: 106 * 4.% = 4.24

आठ: दांव लगाना IsPay

IsPay स्टेकिंग: स्टेक 1 IsPay और वर्तमान कीमत की जांच करें। एकाधिक हिस्सेदारी की अनुमति है. उदाहरण के लिए: SAWP विनिमय मूल्य का उपयोग करते हुए, 10 IsPay: 100 USDT मूल्य = 1000 USDT। इसलिए, 30-दिन की अवधि के भीतर, आप 1500 USDT निकाल सकते हैं। 1500 ÷ 30 = 50 USDT, यानी आप प्रतिदिन 50 USDT प्राप्त कर सकते हैं। यदि आप 100 IsPay x 200 USDT खरीदते हैं, तो मूल्य 20000 USDT है, और आप 30000 USDT निकाल सकते हैं। फिर 30000 ÷ 30 = 1000 USDT, यानी आप प्रतिदिन 1000 USDT प्राप्त कर सकते हैं। 

30 दिनों में 0.5x कमाएँ
60 दिनों में 1 गुना कमाएँ
रोलिंग बोनस के साथ, आप 180 दिनों में 6 गुना लाभ कमा सकते हैं।

सभी दांव पर लगे ISPay नष्ट हो गए हैं; USDT प्राप्त करने के लिए आपको अधिक ISPay खरीदना होगा और इसे dApp पर दांव पर लगाना होगा।

स्टेक्ड ISPay प्रत्येक चक्र के आधार पर 0.2% दैनिक स्टेकिंग खनन पुरस्कार, साथ ही तीन पीढ़ियों से रेफरल पुरस्कार भी अर्जित करता है।

1. स्टेकिंग माइनिंग: 0.2% प्रतिदिन

प्रत्यक्ष रेफरल पुरस्कार: पहली पीढ़ी की कमाई का 30%; दूसरी पीढ़ी की कमाई का 20%; तीसरी पीढ़ी की कमाई का 10%

तेरह: अधिक खिलाड़ियों को खेल के विकास और प्रचार में भाग लेने के लिए प्रोत्साहित करने के लिए, मंच ने एक त्रि-स्तरीय रेफरल कमीशन तंत्र स्थापित किया है। भले ही आपने जमीन दांव पर लगाई हो या आपके पास जमीन हो, आपको खेल में भाग लेने के लिए नए खिलाड़ियों को सफलतापूर्वक आमंत्रित करने के लिए अतिरिक्त सिस्टम पुरस्कार प्राप्त होंगे।`,
  "team_tier_difference": "Team Tier Difference",
  "total_performance_new": "Total",
  "yesterday_performance": "Yesterday",
  "today_performance": "Today",
  "usdt_income": "USDT Income",
  "ispay_income": "ISPAY Income",
  "usdt": "USDT",
  "ispay": "ISPAY",
  "address_short": "Address",
  "direct_push_amount": "Direct Push",
  "reward_amount": "Reward",
  "ranking": "Ranking",
  "yesterday_withdrawal": "Yesterday Withdrawal",
  "previous_day_withdrawal": "Previous Day Withdrawal",
  "today_withdrawal": "Today Withdrawal",
  "team_recharge": "Team Recharge"
}
