import { buildImageGame } from './imageGame'

export default {
  image_game: buildImageGame('ru'),

  "name_1": "Помидор",
  "name_2": "Касаба",
  "name_3": "Виноград",
  "name_4": "Мандарин",
  "name_5": "Манго",
  "name_6": "Яблоко",
  "name_7": "Помело",
  "name_8": "Коко",
  "name_9": "Кокоююбе",
  "name_10": "Редвуд",
  "name_11": "Удобрения",
  "name_12": "Вода",
  "name_13": "Перчатки",
  "name_14": "Пестицид",
  "name_15": "Лопата",
  "name_16": "Слепая коробка",
  "name_17": "Дело",
  "determine": "Определить",
  "confirm": "Подтвердить",
  "sign_out": "Выйти",
  "my_game_log": "Мой игровой журнал",
  "fertility": "Фертильность",
  "fertilizer": "Удобрения",
  "fertilizer2": "Удобрения",
  "land": "Земля",
  "deed": "Дело",
  "level": "Уровень",
  "land_formation": "Формирование Земли",
  "production_increases": "Увеличение производства",
  "plant_cost": "стоимость завода",
  "rule": "Правило",
  "confirm_the_synthesis": "Подтвердить синтез",
  "synthetic_rules": "Синтетические правила",
  "my_git": "Мой USDT",
  "my_ispay": "Мой ISPAY",
  "today_income": "Сегодня",
  "balance": "Баланс",
  "deduct": "Вычесть",
  "price": "Цена",
  "day": "День",
  "date": "Дата",
  "submit_date": "Дата отправки",
  "incoming": "Входящий",
  "stake": "Ставка",
  "period": "Период",
  "can_withdraw": "Можно снять лимит U",
  "reward": "Награда",
  "please_enter_the_amount": "Пожалуйста, введите сумму",
  "please_enter_the_correct_amount": "Пожалуйста, введите правильную сумму",
  "please_enter_the_address": "Пожалуйста, введите адрес",
  "confirm_wait": "Подтвердить Подождите",
  "redemption": "искупление",
  "prev": "Предыдущий",
  "last": "Последний",
  "first": "Первый",
  "next": "Далее",
  "skip": "Перейти к",
  "success": "Успех",
  "recharge_success": "Успех перезарядки",
  "blind_box": "Слепая коробка",
  "magic_blind_box": "Волшебная слепая коробка",
  "countdown_timer": "Таймер обратного отсчета",
  "total_order": "Ожидающие заказы",
  "left_amount": "Оставшаяся сумма",
  "total": "Итого",
  "number_sold": "Количество продано",
  "my_balance": "Мой баланс",
  "my_pledge": "Мое обещание",
  "to_buy_now": "купить сейчас",
  "open_box_get_products": "открыть коробку, получить продукты",
  "seed": "семя",
  "seeds": "Семена",
  "prop": "Опора",
  "language": "Язык",
  "music": "Музыка",
  "congratulations": "Поздравления",
  "synthesis_uccess": "Синтез успеха",
  "goods_not_enough": "Товара недостаточно",
  "please_select_land": "Пожалуйста, выберите землю",
  "please_select_goods": "Пожалуйста, выберите товар",
  "please_select_different_land": "Пожалуйста, выберите разные земли",
  "buying_success": "успех покупки",
  "buy_again": "Купить снова",
  "game_balance": "игровой баланс",
  "wallet_balance": "баланс кошелька",
  "fee": "Плата",
  "pledge_pool": "Залоговый пул",
  "pledge": "Залог",
  "pledge_record": "Запись залога",
  "wait_record": "Ожидание записи",
  "start_game": "Начать игру",
  "get": "Получить",
  "lose": "Проиграть",
  "play_again": "Играть снова",
  "you_win": "Вы выиграли",
  "you_lose": "Ты проигрываешь",
  "sorry": "Извините",
  "yield": "Доходность",
  "grown": "Выросший",
  "off_the_shelves": "с полок",
  "end_of_lease": "конец аренды",
  "sell": "Продать",
  "default": "По умолчанию",
  "bulk_sell": "Массовая продажа",
  "bulk_rent": "Массовая аренда",
  "open": "Открыть",
  "market": "Рынок",
  "leasing": "Лизинг",
  "mine": "Мой",
  "hide": "Скрыть",
  "show": "Показать",
  "send": "Отправить",
  "search": "Поиск",
  "buy": "КУПИТЬ",
  "cancel": "Отмена",
  "copy_success": "Копировать успех",
  "owner": "Владелец",
  "confirm_purchase": "Подтвердить покупку",
  "buy_now": "КУПИТЬ СЕЙЧАС",
  "to_buy": "КУПИТЬ",
  "to_his_house": "К нему домой",
  "holders": "Держатели",
  "description": "Описание",
  "blockchain_network": "Блокчейн-сеть",
  "world": "Мир",
  "my_friend": "Мой друг",
  "not_yet_open": "Еще не открыт",
  "notice": "Уведомление",
    "menu_label_notice": "Уведомл.",
  "menu_label_seed": "Усил. семян",
  "menu_label_granary": "Амбар",
  "menu_label_blind": "Блиндбокс",
  "menu_label_auction": "Аукцион",
  "menu_label_land": "Земля",
  "menu_label_store": "Склад",
  "menu_label_market": "NFT рынок",
  "pop_title_user_info": "Профиль",
  "pop_title_income": "Мой доход",
  "pop_title_result": "Результат",
  "pop_title_rank": "Рейтинг",
  "pop_title_balance": "Баланс",
  "pop_title_login": "Вход в кошелёк",
  "pop_title_login_success": "Кошелёк подключён!",
  "pop_title_sale": "Продажа",
  "pop_title_rent": "Аренда",
  "rank": "Ранг",
  "user_name": "Имя пользователя",
  "manor": "Усадьба",
  "neighbor": "Сосед",
  "recharge": "Перезарядка",
  "setting": "Настройка",
  "harvest": "Урожай",
  "withdraw": "Вывести",
  "withdraw2": "Вывести",
  "game_id": "Идентификатор игры",
  "transfer": "Трансфер",
  "exchange": "Обмен",
  "performance": "Производительность",
  "invite_git": "Пригласить ISPAY",
  "inviter": "Приглашающий",
  "neighbors": "Соседи",
  "more": "Подробнее",
  "address": "Адрес",
  "time": "Время",
  "bonus_time": "Бонусное время",
  "game": "игра",
  "wallet": "кошелек",
  "warehouse": "Склад",
  "plant": "Завод",
  "select": "Выбрать",
  "rent": "Аренда",
  "cultivate": "культивировать",
  "cultivate_land": "Возделывать землю",
  "change_land": "Изменить землю",
  "revoke_land": "Отозвать землю",
  "sell_success": "Продать успех",
  "rent_success": "Аренда успеха",
  "buy_success": "Купить Успех",
  "to_his_hourse": "К его часу",
  "harvest_ratio": "Коэффициент сбора урожая",
  "off_the_shelves_success": "Готовый успех",
  "address_empty": "Адрес не пустой",
  "level2": "Уровень",
  "subscription_amount": "Сумма подписки",
  "ratio": "Соотношение",
  "released": "Выпущено",
  "not_released": "Не выпущено",
  "static_state": "Статическое состояние",
  "direct_push": "Прямой толчок",
  "direct_acceleration": "Прямое ускорение",
  "team": "Команда",
  "good_ordinary": "Хороший Обыкновенный",
  "all_dividend": "Все дивиденды",
  "total_performance": "Общая производительность",
  "direct_performance": "Прямое исполнение",
  "regional_performance": "Региональная производительность",
  "community_performance": "Производительность сообщества",
  "direct_number": "Прямой номер",
  "activated_number": "Активированный номер",
  "team_number": "Номер команды",
  "to_buy_detail": "КУПИТЬ ПОДРОБНО",
  "amt": "Сумма",
  "daily": "Ежедневно",
  "subscribe": "Подписаться",
  "direct": "Прямой",
  "static": "Статический",
  "all_net": "Все сети",
  "level_number": "Номер уровня",
  "all": "Все",
  "my_plant": "Мое растение",
  "company": "Компания",
  "community": "Сообщество",
  "mining": "Горное дело",
  "please_set_your_neighbor": "Пожалуйста, установите своего соседа",
  "please_ennter_the_neighbor_id": "Пожалуйста, введите идентификатор соседа",
  "please_visit_the_game_in_the_following_wallet": "Пожалуйста, посетите игру в следующем кошельке!",
  "granary_rule": "Пользователи могут хранить ISPAY в хранилище с ежедневной доходностью 0,3%, которую можно погасить в любое время; Проценты будут начисляться после 0:00 времени UTC+8 на следующий день после хранения (D+1);",
  "land_rule": "Вы можете использовать землю + землю, удобрения + фрукты, чтобы создать новую землю. Земля распределяется случайным образом в соответствии со стохастическим алгоритмом смарт-контрактов, с различной редкостью и плодородием. Чем ниже редкость, тем выше бонус к урожайности, тем выше плодородие, тем больше растений можно посадить!",
  "all_rule": `Ферма магических кристаллов: руководство по игровому процессу

I. Слепые ящики: открытие слепого ящика стоит 100 U и дает шанс получить семена или предметы. Максимальное количество семян — 117, минимальное — 106.

II. Seed Amplifier: увлекательный игровой режим с использованием механизма PoS, в котором игроки могут выступать в роли дилеров.

III. Стейкинг в основной сети

IV. Ежедневный доход от покупки земли (взвешенное распределение по 5000 окладов)

V. Прямая передача земельных участков:
Первое поколение: 3%
Второе поколение: 2%
Третье поколение: 1%
Бонус управления: (Разница в уровнях)

VI. Список семян (Сажать два раза в день)

1: Помидор: 106-108U

2: Канталупа: 107-109U

3: Виноград: 108-109U

4: Оранжевый: 109-111U

5: Манго: 100-112 ед.

6: Яблоко: 111-113U

7. Грейпфрут: 112–114 ед.

8: Кокос: 112-115U

9: Дата: 113-116У.

10. Redwood: 114-117U Доход от прямых рефералов Доход от ставок

Первое поколение: 0,3%

Второе поколение: 0,2%

Третье поколение: 0,1%

VII: Использование предметов

1: Лопата: используется для предотвращения удаления растения в течение одного часа. Арендатор получает 106 * 0,5% = 0,53 от текущей доходности при удалении растения.

2: Полив: Растения имеют 5%-ный механизм «потребности в поливе» во время роста; без полива рост прекращается. Этот предмет предотвращает остановку роста.

3: Инсектицид: вероятность появления насекомых во время роста составляет 5%. Если его не использовать, рост остановится.

4. Перчатки: можно использовать для «кражи урожая» до 50 раз. 1% от каждой посадки. Расстояние 106 * 1% = 1,06

5. Аренда земли: аренда земли другим пользователям принесет 4% от количества фруктовых деревьев, которые получит арендатор.  Пример: 106 * 4,% = 4,24.

Восьмое: Ставка IsPay

IsPay Ставка: сделайте ставку 1 IsPay и проверьте текущую цену. Допускаются множественные ставки. Например: используя биржевую цену SAWP, 10 IsPay: цена 100 USDT = 1000 USDT. Таким образом, в течение 30 дней вы можете вывести 1500 USDT. 1500 ÷ 30 = 50 USDT, то есть вы можете получать 50 USDT ежедневно. Если вы купите 100 IsPay x 200 USDT, их стоимость составит 20 000 USDT, и вы сможете вывести 30 000 USDT. Тогда 30000 ÷ 30 = 1000 USDT, то есть вы можете получать 1000 USDT ежедневно. 

Заработайте 0,5x за 30 дней
Заработайте 1 раз за 60 дней
Благодаря скользящим бонусам вы можете заработать 6-кратную прибыль за 180 дней.

Все поставленные ISPay уничтожаются; вам нужно купить больше ISPay и поставить их на dApp, чтобы получить USDT.

Ставка ISPay также получает 0,2% ежедневных вознаграждений за ставку за майнинг в зависимости от каждого цикла, а также реферальные вознаграждения от трех поколений.

1. Ставка майнинга: 0,2% в день

Прямые реферальные вознаграждения: 30% от заработка первого поколения; 20% доходов второго поколения; 10% от дохода третьего поколения

Тринадцать: Чтобы побудить больше игроков участвовать в разработке и продвижении игр, платформа создала трехуровневый механизм реферальной комиссии. Независимо от того, сделали ли вы ставку или владеете землей, вы получите дополнительные системные награды за успешное приглашение новых игроков к участию в игре.`,
  "team_tier_difference": "Team Tier Difference",
  "total_performance_new": "Total",
  "yesterday_performance": "Yesterday",
  "today_performance": "Today",
  "usdt_income": "USDT Income",
  "ispay_income": "ISPAY Income",
  "usdt": "USDT",
  "ispay": "ISPAY",
  "address_short": "Address",
  "direct_push_amount": "Direct Push",
  "reward_amount": "Reward",
  "ranking": "Ranking",
  "yesterday_withdrawal": "Yesterday Withdrawal",
  "previous_day_withdrawal": "Previous Day Withdrawal",
  "today_withdrawal": "Today Withdrawal",
  "team_recharge": "Team Recharge"
}
