import { buildImageGame } from './imageGame'

export default {
  image_game: buildImageGame('th'),

  "name_1": "มะเขือเทศ",
  "name_2": "คาซาบา",
  "name_3": "องุ่น",
  "name_4": "ส้มเขียวหวาน",
  "name_5": "มะม่วง",
  "name_6": "แอปเปิ้ล",
  "name_7": "ส้มโอ",
  "name_8": "โกโก้",
  "name_9": "โคโค่จูจูบ",
  "name_10": "เรดวู้ด",
  "name_11": "ปุ๋ย",
  "name_12": "น้ำ",
  "name_13": "ถุงมือ",
  "name_14": "ยาฆ่าแมลง",
  "name_15": "พลั่ว",
  "name_16": "กล่องตาบอด",
  "name_17": "โฉนด",
  "determine": "กำหนด",
  "confirm": "ยืนยัน",
  "sign_out": "ออกจากระบบ",
  "my_game_log": "บันทึกเกมของฉัน",
  "fertility": "ภาวะเจริญพันธุ์",
  "fertilizer": "ปุ๋ย",
  "fertilizer2": "ปุ๋ย",
  "land": "ที่ดิน",
  "deed": "โฉนด",
  "level": "ระดับ",
  "land_formation": "การก่อตัวของที่ดิน",
  "production_increases": "การผลิตเพิ่มขึ้น",
  "plant_cost": "ต้นทุนพืช",
  "rule": "กฎ",
  "confirm_the_synthesis": "ยืนยันการสังเคราะห์",
  "synthetic_rules": "กฎสังเคราะห์",
  "my_git": "USDT ของฉัน",
  "my_ispay": "ISPAY ของฉัน",
  "today_income": "วันนี้",
  "balance": "ยอดคงเหลือ",
  "deduct": "หัก",
  "price": "ราคา",
  "day": "วัน",
  "date": "วันที่",
  "submit_date": "วันที่ส่ง",
  "incoming": "เข้ามา",
  "stake": "เดิมพัน",
  "period": "ระยะเวลา",
  "can_withdraw": "สามารถถอน U Limit ได้",
  "reward": "รางวัล",
  "please_enter_the_amount": "กรุณากรอกจำนวนเงิน",
  "please_enter_the_correct_amount": "กรุณากรอกจำนวนเงินที่ถูกต้อง",
  "please_enter_the_address": "กรุณากรอกที่อยู่",
  "confirm_wait": "ยืนยันการรอ",
  "redemption": "การไถ่ถอน",
  "prev": "ก่อนหน้า",
  "last": "สุดท้าย",
  "first": "อันดับแรก",
  "next": "ถัดไป",
  "skip": "ข้ามไปที่",
  "success": "ความสำเร็จ",
  "recharge_success": "เติมเงินสำเร็จ",
  "blind_box": "กล่องตาบอด",
  "magic_blind_box": "กล่องตาบอดวิเศษ",
  "countdown_timer": "จับเวลาถอยหลัง",
  "total_order": "รอรับออเดอร์",
  "left_amount": "จำนวนเงินที่เหลือ",
  "total": "รวม",
  "number_sold": "เบอร์ขายแล้ว",
  "my_balance": "ความสมดุลของฉัน",
  "my_pledge": "คำมั่นสัญญาของฉัน",
  "to_buy_now": "ที่จะซื้อตอนนี้",
  "open_box_get_products": "เปิดกล่องรับสินค้า",
  "seed": "เมล็ดพันธุ์",
  "seeds": "เมล็ดพืช",
  "prop": "ข้อเสนอ",
  "language": "ภาษา",
  "music": "ดนตรี",
  "congratulations": "ขอแสดงความยินดี",
  "synthesis_uccess": "ความสำเร็จในการสังเคราะห์",
  "goods_not_enough": "สินค้าไม่พอ",
  "please_select_land": "กรุณาเลือกที่ดิน",
  "please_select_goods": "กรุณาเลือกสินค้า",
  "please_select_different_land": "กรุณาเลือกที่ดินอื่น",
  "buying_success": "การซื้อความสำเร็จ",
  "buy_again": "ซื้ออีกครั้ง",
  "game_balance": "ความสมดุลของเกม",
  "wallet_balance": "ยอดคงเหลือในกระเป๋าสตางค์",
  "fee": "ค่าธรรมเนียม",
  "pledge_pool": "จำนำพูล",
  "pledge": "คำมั่นสัญญา",
  "pledge_record": "บันทึกคำมั่นสัญญา",
  "wait_record": "รอบันทึก",
  "start_game": "เริ่มเกม",
  "get": "รับ",
  "lose": "แพ้",
  "play_again": "เล่นอีกครั้ง",
  "you_win": "คุณชนะ",
  "you_lose": "คุณแพ้",
  "sorry": "ขออภัย",
  "yield": "อัตราผลตอบแทน",
  "grown": "เติบโต",
  "off_the_shelves": "ออกจากชั้นวาง",
  "end_of_lease": "สิ้นสุดสัญญาเช่า",
  "sell": "ขาย",
  "default": "ค่าเริ่มต้น",
  "bulk_sell": "ขายจำนวนมาก",
  "bulk_rent": "เช่าจำนวนมาก",
  "open": "เปิด",
  "market": "ตลาด",
  "leasing": "ลีสซิ่ง",
  "mine": "ของฉัน",
  "hide": "ซ่อน",
  "show": "แสดง",
  "send": "ส่ง",
  "search": "ค้นหา",
  "buy": "ซื้อ",
  "cancel": "ยกเลิก",
  "copy_success": "คัดลอกความสำเร็จ",
  "owner": "เจ้าของ",
  "confirm_purchase": "ยืนยันการซื้อ",
  "buy_now": "ซื้อตอนนี้",
  "to_buy": "ซื้อ",
  "to_his_house": "ไปที่บ้านของเขา",
  "holders": "ผู้ถือ",
  "description": "คำอธิบาย",
  "blockchain_network": "เครือข่ายบล็อคเชน",
  "world": "โลก",
  "my_friend": "เพื่อนของฉัน",
  "not_yet_open": "ยังไม่เปิด",
  "notice": "ประกาศ",
    "menu_label_notice": "แจ้งเตือน",
  "menu_label_seed": "ขยายเมล็ด",
  "menu_label_granary": "ยุ้งฉาง",
  "menu_label_blind": "กล่องสุ่ม",
  "menu_label_auction": "ประมูล",
  "menu_label_land": "ที่ดิน",
  "menu_label_store": "คลัง",
  "menu_label_market": "ตลาด NFT",
  "pop_title_user_info": "ศูนย์ส่วนตัว",
  "pop_title_income": "รายได้ของฉัน",
  "pop_title_result": "ผลลัพธ์",
  "pop_title_rank": "อันดับ",
  "pop_title_balance": "ยอดคงเหลือ",
  "pop_title_login": "เข้าสู่ระบบกระเป๋า",
  "pop_title_login_success": "เชื่อมต่อแล้ว!",
  "pop_title_sale": "ตั้งค่าขาย",
  "pop_title_rent": "ตั้งค่าเช่า",
  "rank": "อันดับ",
  "user_name": "ชื่อผู้ใช้",
  "manor": "คฤหาสน์",
  "neighbor": "เพื่อนบ้าน",
  "recharge": "เติมเงิน",
  "setting": "การตั้งค่า",
  "harvest": "เก็บเกี่ยว",
  "withdraw": "ถอนออก",
  "withdraw2": "ถอนออก",
  "game_id": "รหัสเกม",
  "transfer": "โอน",
  "exchange": "แลกเปลี่ยน",
  "performance": "ประสิทธิภาพ",
  "invite_git": "เชิญ ISPAY",
  "inviter": "ผู้เชิญ",
  "neighbors": "เพื่อนบ้าน",
  "more": "เพิ่มเติม",
  "address": "ที่อยู่",
  "time": "เวลา",
  "bonus_time": "เวลาโบนัส",
  "game": "เกม",
  "wallet": "กระเป๋าสตางค์",
  "warehouse": "คลังสินค้า",
  "plant": "พืช",
  "select": "เลือก",
  "rent": "เช่า",
  "cultivate": "ปลูกฝัง",
  "cultivate_land": "เพาะปลูกที่ดิน",
  "change_land": "เปลี่ยนที่ดิน",
  "revoke_land": "เพิกถอนที่ดิน",
  "sell_success": "ขายความสำเร็จ",
  "rent_success": "ความสำเร็จในการเช่า",
  "buy_success": "ซื้อความสำเร็จ",
  "to_his_hourse": "ถึงชั่วโมงของเขา",
  "harvest_ratio": "อัตราส่วนการเก็บเกี่ยว",
  "off_the_shelves_success": "ความสำเร็จจากชั้นวาง",
  "address_empty": "ที่อยู่ไม่ว่างเปล่า",
  "level2": "ระดับ",
  "subscription_amount": "จำนวนการสมัครสมาชิก",
  "ratio": "อัตราส่วน",
  "released": "เปิดตัวแล้ว",
  "not_released": "ไม่ปล่อย",
  "static_state": "สถานะคงที่",
  "direct_push": "ผลักดันโดยตรง",
  "direct_acceleration": "การเร่งความเร็วโดยตรง",
  "team": "ทีม",
  "good_ordinary": "ธรรมดาดี",
  "all_dividend": "เงินปันผลทั้งหมด",
  "total_performance": "ประสิทธิภาพโดยรวม",
  "direct_performance": "ประสิทธิภาพโดยตรง",
  "regional_performance": "ประสิทธิภาพระดับภูมิภาค",
  "community_performance": "ประสิทธิภาพของชุมชน",
  "direct_number": "หมายเลขตรง",
  "activated_number": "หมายเลขเปิดใช้งาน",
  "team_number": "หมายเลขทีม",
  "to_buy_detail": "รายละเอียดการซื้อ",
  "amt": "จำนวน",
  "daily": "รายวัน",
  "subscribe": "สมัครสมาชิก",
  "direct": "โดยตรง",
  "static": "คงที่",
  "all_net": "เน็ตทั้งหมด",
  "level_number": "หมายเลขระดับ",
  "all": "ทั้งหมด",
  "my_plant": "โรงงานของฉัน",
  "company": "บริษัท",
  "community": "ชุมชน",
  "mining": "การทำเหมืองแร่",
  "please_set_your_neighbor": "กรุณาตั้งค่าเพื่อนบ้านของคุณ",
  "please_ennter_the_neighbor_id": "กรุณากรอกรหัสเพื่อนบ้าน",
  "please_visit_the_game_in_the_following_wallet": "กรุณาเยี่ยมชมเกมในกระเป๋าสตางค์ต่อไปนี้!",
  "granary_rule": "ผู้ใช้สามารถจัดเก็บ ISPAY ไว้ในยุ้งฉางโดยมีผลตอบแทนรายวัน 0.3% ซึ่งสามารถแลกได้ตลอดเวลา ดอกเบี้ยจะเกิดขึ้นหลังเวลา 0:00 UTC+8 ในวันถัดไปหลังจากการจัดเก็บ(D+1)",
  "land_rule": "คุณสามารถใช้ที่ดิน + ที่ดิน ปุ๋ย + ผลไม้เพื่อสร้างที่ดินใหม่ ที่ดินจะถูกสุ่มตามอัลกอริธึมสัญญาอัจฉริยะ โดยมีความหายากและความอุดมสมบูรณ์ที่แตกต่างกันไป ยิ่งความหายากต่ำ โบนัสผลผลิตก็จะยิ่งสูง ความอุดมสมบูรณ์ก็สูง ก็สามารถปลูกพืชได้มากขึ้น!",
  "all_rule": `Magic Crystal Farm: คู่มือการเล่นเกม

I. Blind Boxes: การเปิดกล่องตาบอดมีค่าใช้จ่าย 100 U และมีโอกาสได้รับเมล็ดพันธุ์หรือไอเทม จำนวนเมล็ดสูงสุดคือ 117 และขั้นต่ำคือ 106

ครั้งที่สอง Seed Amplifier: โหมดการเล่นที่สนุกสนานโดยใช้กลไก PoS ซึ่งผู้เล่นสามารถทำหน้าที่เป็นดีลเลอร์ได้

III. การปักหลัก Mainnet

IV. รายได้จากการซื้อที่ดินรายวัน (การกระจายแบบถ่วงน้ำหนัก 5,000 ispay)

V. การอ้างอิงที่ดินโดยตรง:
รุ่นแรก: 3%
รุ่นที่สอง: 2%
รุ่นที่สาม: 1%
โบนัสการจัดการ: (ส่วนต่างระดับ)

วี. รายการเมล็ดพันธุ์ (ปลูกวันละสองครั้ง)

1: มะเขือเทศ: 106-108U

2: แคนตาลูป: 107-109U

3: องุ่น: 108-109U

4: สีส้ม: 109-111U

5: มะม่วง: 100-112U

6: แอปเปิ้ล: 111-113U

7: ส้มโอ: 112-114U

8: มะพร้าว: 112-115U

9: วันที่: 113-116U

10: เรดวูด: 114-117U รายได้จากการอ้างอิงโดยตรง รายได้จากการปักหลัก

รุ่นแรก: 0.3%

รุ่นที่สอง: 0.2%

รุ่นที่สาม: 0.1%

VII: การใช้ไอเทม

1: พลั่ว: ใช้เพื่อป้องกันไม่ให้ต้นไม้ถูกย้ายออกภายในหนึ่งชั่วโมง ผู้เช่าจะได้รับ 106 * 0.5% = 0.53 ของผลตอบแทนปัจจุบันเมื่อรื้อถอนต้นไม้

2: การรดน้ำ: พืชมีกลไก "ต้องการการรดน้ำ" 5% ในระหว่างการเจริญเติบโต หากไม่มีการรดน้ำการเจริญเติบโตจะหยุดลง รายการนี้ป้องกันไม่ให้การเติบโตหยุดลง

3: ยาฆ่าแมลง: มีโอกาส 5% ที่แมลงจะปรากฏขึ้นระหว่างการเจริญเติบโต หากไม่ใช้การเจริญเติบโตจะหยุดลง

4: ถุงมือ: สามารถใช้สำหรับ "ขโมยพืชผล" ได้สูงสุด 50 ครั้ง 1% ของการปลูกแต่ละครั้ง ระยะทาง 106 * 1% = 1.06

5: การเช่าที่ดิน: การเช่าที่ดินให้กับผู้ใช้รายอื่นจะให้ผลตอบแทน 4% ของจำนวนต้นผลไม้ที่ผู้เช่าได้รับ  ตัวอย่าง: 106 * 4.% = 4.24

แปด: การปักหลัก IsPay

IsPay การเดิมพัน: การเดิมพัน 1 IsPay และตรวจสอบราคาปัจจุบัน อนุญาตให้วางเดิมพันได้หลายครั้ง ตัวอย่างเช่น: การใช้ราคาแลกเปลี่ยน SAWP 10 IsPay: 100 USDT ราคา = 1,000 USDT ดังนั้นภายในระยะเวลา 30 วัน คุณสามารถถอนเงินได้ 1500 USDT 1500 __ 30 = 50 USDT หมายความว่าคุณสามารถได้รับ 50 USDT ทุกวัน หากคุณซื้อ 100 IsPay x 200 USDT มูลค่าคือ 20000 USDT และคุณสามารถถอนออกได้ 30000 USDT จากนั้น 30,000 __ 30 = 1,000 USDT ซึ่งหมายความว่าคุณจะได้รับ 1,000 USDT ทุกวัน 

รับ 0.5 เท่าใน 30 วัน
รับ 1x ใน 60 วัน
ด้วยโบนัสต่อเนื่อง คุณสามารถรับผลกำไร 6 เท่าใน 180 วัน

ISPay ที่เดิมพันไว้ทั้งหมดถูกทำลาย คุณต้องซื้อ ISPay เพิ่มเติม และวางเดิมพันใน dApp เพื่อรับ USDT

Staked ISPay ยังรับรางวัลการขุดปักหลัก 0.2% ต่อวันโดยขึ้นอยู่กับแต่ละรอบ บวกกับรางวัลการอ้างอิงจากสามรุ่น

1. การขุดปักหลัก: 0.2% ทุกวัน

รางวัลการอ้างอิงโดยตรง: 30% ของรายได้รุ่นแรก 20% ของรายได้รุ่นที่สอง 10% ของรายได้รุ่นที่สาม

สิบสาม: เพื่อกระตุ้นให้ผู้เล่นมีส่วนร่วมในการพัฒนาและโปรโมตเกมมากขึ้น แพลตฟอร์มดังกล่าวได้จัดตั้งกลไกค่าคอมมิชชั่นการอ้างอิงสามระดับ ไม่ว่าคุณจะเดิมพันหรือเป็นเจ้าของที่ดินก็ตาม คุณจะได้รับรางวัลระบบเพิ่มเติมสำหรับการเชิญผู้เล่นใหม่ให้เข้าร่วมในเกมได้สำเร็จ`,
  "team_tier_difference": "Team Tier Difference",
  "total_performance_new": "Total",
  "yesterday_performance": "Yesterday",
  "today_performance": "Today",
  "usdt_income": "USDT Income",
  "ispay_income": "ISPAY Income",
  "usdt": "USDT",
  "ispay": "ISPAY",
  "address_short": "Address",
  "direct_push_amount": "Direct Push",
  "reward_amount": "Reward",
  "ranking": "Ranking",
  "yesterday_withdrawal": "Yesterday Withdrawal",
  "previous_day_withdrawal": "Previous Day Withdrawal",
  "today_withdrawal": "Today Withdrawal",
  "team_recharge": "Team Recharge"
}
